//چون خودمون می خواهیم یک هوک بسازیم دیگه نیازی به ایمپورت کردن ریکت نداریم
import { useState , useEffect } from 'react'

//چون تابعی که داریم میسازیم قراره نقش هوک رو داشته باشه حتما اول اسم تابع باید کلمه ی یوز رو بیاریم
const useDarkMode = () =>{

    //میخواهیم تم ما از دارک به لایت یا از لایت به دارک تغییر کنه
    // و این تغییر کردن براساس چک کردن یک چیزی داخل لوکال استورج باشه
    //پس یعنی یک تغییر استیت داریم
    //چون چک کردن در لوکال استورج صورت میگیره و مقادیر در لوکال استورج بصورت رشته هستند
    //پس مقدار اولیه ی استیت باید رشته باشه
    const [theme , setTheme] = useState('light')
    //مقدار استیت اولیه یا دارکه یا لایت

    //حالا برای اپدیت کردن تم اول برو به لوکال مقدار اولیه ی تم رو بررسی کن
    // اگر لایت بود بکن دارک و برعکس
    
    //میدانیم برای استفاده از  متد ست تم باید اول یک تابع تعریف کنیم
    //تابع تاگل تم برای یک دکمه است
    //که مثلا اگه تم لایت بود وقتی بزن روی دکمه تم دارک بشه یا برعکس
    const toogleTheme = ()=>{
        if(theme === 'light'){
            window.localStorage.setItem('theme' , 'dark')
            setTheme('dark')
        }else {
            window.localStorage.setItem('theme' , 'light')
            setTheme('light')
        }
    }
    //مورد بعدی چک شدن براساس اجرای برنامه است
    //هرجا اسم چک شدن بر اساس اجرای برنامه اومد یاد یوز افکت بیوفت
    useEffect(()=>{
        //کاری ک اینجا بعد از یکبار اجرای برنامه میشه اینه که
        //میگه وقتی یکبار برنامه اجرا شد برو به لوکال ببین مثلا یوزر تم رو روی چی گذاشته
        //اگه تم روی دارک بود همون دارک رو نشون بده و اگر روی لایت بود لایت نشون بده
        //یعنی اینطوری نباشه که یوزر قبلا دارک رو انتخاب کرده وقتی دوباره میاد به برنامه تم به لایت عوض شده باشه
        //بطور کلی یوزر هر تمی رو انتخاب کنه در لوکال سیو میشه تا بعد از ورود مجدد همون تم حفظ بشه
    const localTheme = window.localStorage.getItem('theme')
    if(localTheme){
        setTheme(localTheme)
    }
    }, [])

    //این هوکی که ما تعریف کردیم باید مث یوز استیت دو مقدار برگردونه
    // تا زمانی که خاستیم از اون جای دیگه استفاده کنیم به مشکل برنخوریم
    return [theme , toogleTheme]
}

export default useDarkMode


//اینکه از این هوک کاستوم کجا استفاده کنیم بستگی به منطق برنامه داره